import { ProfileData } from '@/common/interfaces/profile'

export const ProfileItem: ProfileData = {
  aboutFollow:
    '基本的に自分からフォロー、フォロバすることはありません。\n' +
    '理由としては、今のTLを維持したいからです。\n' +
    'TLの速度が早くなったりするのがあまり好きではないのです。\n' +
    'そのあたりを理解していただき、フォロバされなくても仕方ないと思ってフォローしてください。\n' +
    'こちらからフォローしていなくてもリプライはきちんと返しますし、リツイートされた人のツイートは少しの間眺めたりもしています。\n' +
    'ですので完全に無視するということはほとんどありません。',
  aboutTweet:
    '私個人の見解ですが、Twitterは個人がある程度自由に発言できる場所だと思っています。（もちろんバカッターと言われるようなことは論外ですが。）\n' +
    'ですので、フォロワー様からツイートに関して、ああしろこうしろ言われてもたいていそれに従うことはないと思います。\n' +
    '自分のすきなようにツイートさせて頂きたいです。\n' +
    'そしてもし目障りであったり、気に入らなかったり、その他理由は何であれ、自由にブロックやリムーブをして頂いて構いません。',
  profile: [
    'taoといいます\n' +
      '呼び方は "tao" とか "たお" とかでよろしくです\n' +
      'よく呼ばれてるのは "たお" のほうです\n' +
      '昔からのフォロワーさんには "たおっぱい" とかで呼ばれてます',
    '元Android趣味アプリ開発者\n' +
      'Javaから始まりKotlinを書いていました\n' +
      '最近は仕事でReactやFlutterを書いています',
  ],
}
