import { DeviceData } from '@/common/interfaces/device'

/* 譲渡/売却端末一覧 */
export const TransferredDeviceItems: DeviceData[] = [
  { name: 'ISW11F' },
  {
    name: 'Xperia XZ1（G8342）',
    note:
      '2018/05/08 16時着弾。\n' +
      '05/06 21時半にExpansysで購入。香港からきた。\n' +
      'TWRP＆Magisk導入した。\n' +
      '断腸の念でNexusシリーズを引退。\n' +
      'デバッグ用途として使うことさえなくなったので2022/03/16に友人に譲渡した。',
  },
  {
    name: 'Pixel 3 128GB',
    note:
      '2018/12/14 12時着弾。\n' +
      'やはりNexusシリーズが忘れられなくて買ってしまった。\n' +
      'Xperiaと同じくTWRP＆Magiskを導入。\n' +
      '置き物と化していたので2022/11/09に友人に譲渡。',
  },
  {
    name: 'Pixel 6a 128GB',
    note:
      '2022/10/07にヨドバシカメラのauで購入。\n' +
      'キャンペーンをしていたので-17,100円の36,800円で購入できた。\n' +
      'Google Tensorを使ってみたかったのと検証用としての運用。\n' +
      '7aを購入したので2023/05/14にいとこに1.5万円で売却。',
  },
  {
    name: 'iPhone 7 32GB (Gold)',
    note:
      '2020/09/11にほたるから譲り受けた。\n' +
      '久しぶりのiOS端末である。\n' +
      'デバッグなどはiPhone12miniで行うので2023/09/19にイオシスへ売却。2,500円。',
  },
  {
    name: 'Pixel 5 128GB',
    note:
      '2021/03/09 10時半着弾。\n' +
      '2年間愛用したPixel 3のバッテリーがヘタってきたり、新しいものが欲しくなったので買った。\n' +
      'Android 11にTWRPが対応していないのでMagiskのみを導入。\n' +
      'Pixel 8購入の下取りへ2024/01/07に発送。キャンペーン適用で43,100円の払い戻し。',
  },
  {
    name: 'Pixel 8 256GB',
    note:
      '2024/01/05 14:45着弾。\n' +
      'Pixel 5を3年近くも使っていたのでさすがに乗り換えることにした。\n' +
      '背面の指紋認証はなくなってしまったが、画面内指紋認証と顔認証が割と優秀なのですぐ慣れた。\n' +
      'メイン端末なのでいつも通りMagiskを導入。\n' +
      'Pixel 9購入の下取りへ2024/12/08に発送。ブラックフライデー価格で64,900円の払い戻し。',
  },
  {
    name: 'Pixel 7a 128GB',
    note:
      '2023/05/13着弾。\n' +
      '05/11に発売され、6aとは違いQiに対応したとのことで即購入。\n' +
      'サブ端末を充電するのをよく忘れていたので置くだけで充電できるという快適さを手に入れた。\n' +
      'Pixel 10 Pro購入の下取りへ2025/09/01に発送。30,000円の払い戻し。',
  },
]
